package com.example.javajoke;


public class Joker {
    public static final String[] JOKE_LIB ={
            "电脑游戏从小就训练你，把“Boss”当作自己最大的敌人。",
            "收入这么少，我哪需要那么多支付方式？",
            "一个残酷现实是，你决定笨鸟先飞，别人后来扑腾两下就把你超了。",
            "“混不好我就不回去了”，混音师说。",
            "大师越来越少了，因为都被央视抓去做小罐茶了。",
            "同事刚才放了个又响又臭的屁，可谓是闻者伤心，听者落泪。",
            "老公你姓黄我姓马，为啥生个孩子你让他姓李,黄加马得李。",
            "泰坦尼克号沉没，趴在木板上的肉丝对杰克说：“游泳健身了解一下？”",
            "客服其实是造成便秘的主要原因，因为他们经常对用户说：很抱歉给您带来不便~",
            "我妈给我泡了杯咖啡，我对她表示了赞美，她说：我就知道你喜欢娘泡的东西。"


    };

    public String getJoke(){
            int jokeId = (int)(1+Math.random()*(10-1+1));
            return JOKE_LIB[jokeId-1];
    }

}
